In [4]:
#Exp No:-06
#Name:- Komal Dhande
#Sub:-Emerging Trends
#Aim:- To perform Simple Linear Regression and find out the coefficients of it.
#Date:- 09-09-23
#Roll_No:- 18
#Sec:-B

In [2]:
import pandas as pd

In [5]:
from matplotlib import pyplot as plt

In [6]:
import numpy as np

In [7]:
import os

In [8]:
os.getcwd()

'C:\\Users\\HP'

In [9]:
os.chdir("C:\\Users\\HP\\Desktop")

In [38]:
df=pd.read_csv("salary.csv")

In [11]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [12]:
df.tail()

    YearsExperience  Salary
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [13]:
#to check datatype
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 608.0 bytes

In [14]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [16]:
df.shape

(30, 2)

In [17]:
#no of fields
df.size

60

In [18]:
df.ndim

2

In [20]:
df.isnull()

    YearsExperience  Salary
0             False   False
1             False   False
2             False   False
3             False   False
4             False   False
5             False   False
6             False   False
7             False   False
8             False   False
9             False   False
10            False   False
11            False   False
12            False   False
13            False   False
14            False   False
15            False   False
16            False   False
17            False   False
18            False   False
19            False   False
20            False   False
21            False   False
22            False   False
23            False   False
24            False   False
25            False   False
26            False   False
27            False   False
28            False   False
29            False   False

In [21]:
df.isnull

<bound method DataFrame.isnull of     YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872>

In [22]:
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [23]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [24]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [25]:
a=(1,2,3,4,5,6,7,8,9,10)

In [28]:
a[9]

10

In [29]:
a[-10]

1

In [30]:
df.loc[4,'Salary']

39891

In [31]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [32]:
df.loc[23]

YearsExperience         8.2
Salary             113812.0
Name: 23, dtype: float64

In [34]:
df.head(24)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812

In [35]:
a=(1,2,3,4,5,6,7,8,9,10)

In [36]:
a[1:4]

(2, 3, 4)

In [45]:
df.iloc[0,1]

39343

In [42]:
df.loc[1,'Salary']

46205

In [55]:
#Assigning values in x & y
X=df.iloc[:, :-1].values
Y=df.iloc[:, -1].values
#x=df['YearsExperience']
#y=df['Salary']

In [57]:
print(X)

[[ 1.1]
 [ 1.3]
 [ 1.5]
 [ 2. ]
 [ 2.2]
 [ 2.9]
 [ 3. ]
 [ 3.2]
 [ 3.2]
 [ 3.7]
 [ 3.9]
 [ 4. ]
 [ 4. ]
 [ 4.1]
 [ 4.5]
 [ 4.9]
 [ 5.1]
 [ 5.3]
 [ 5.9]
 [ 6. ]
 [ 6.8]
 [ 7.1]
 [ 7.9]
 [ 8.2]
 [ 8.7]
 [ 9. ]
 [ 9.5]
 [ 9.6]
 [10.3]
 [10.5]]

In [58]:
print(Y)

[ 39343  46205  37731  43525  39891  56642  60150  54445  64445  57189
  63218  55794  56957  57081  61111  67938  66029  83088  81363  93940
  91738  98273 101302 113812 109431 105582 116969 112635 122391 121872]

In [47]:
a=(1,2,3,4,5,6,7,8,9,10)

In [48]:
a[:2]

(1, 2)

In [49]:
a[2:]

(3, 4, 5, 6, 7, 8, 9, 10)

In [51]:
a[1:6:2]

(2, 4, 6)

In [52]:
a[1:6:1]

(2, 3, 4, 5, 6)